#+FILETAGS: HACKING

* Game Development
  :PROPERTIES:
  :ID:       faa642eb-8002-4af8-a098-2ab4e75b86f1
  :END:
PROPERTIES:
CATEGORY: Games
END:

** TODO kilobolt android game tutorial		      :ANDROID:GAMES:SOMEDAY:
   :PROPERTIES:
   :ID:       95c8b378-9880-4b0a-88ae-ef1789ef0cf5
   :END:
http://www.kilobolt.com/game-development-tutorial.html
[2012-10-22 Mon 18:07]
*** NEXT Find out where I'm up to and make next tasks for each week
    :PROPERTIES:
    :ID:       1299357f-6450-4633-8f67-5706b2334bf5
    :END:
** TODO java code geeks android game tutorial	      :ANDROID:GAMES:SOMEDAY:
[[http://www.javacodegeeks.com/2011/06/android-game-development-tutorials.html][tutorial]] 
  CLOCK: [2012-10-23 Tue 17:06]--[2012-10-23 Tue 17:06] =>  0:00
   :PROPERTIES:
   :ID:       6a9762f7-dd70-4f1f-a09b-eef4151fc4f8
   :END:
[2012-10-23 Tue 17:06]
*** NEXT Java code geeks Tutorial
    :PROPERTIES:
    :ID:       953d8f2c-22b2-40ad-bbde-e2eabc453c60
    :END: 

* Programming
  :PROPERTIES:
  :ID:       5353497c-9613-4623-a4ba-4ac6a37e42fe
  :END:
** Structure and Interpretation of Computer Programs 
http://mitpress.mit.edu/sicp/
http://groups.csail.mit.edu/mac/classes/6.001/abelson-sussman-lectures/
* emacs
  :PROPERTIES:
  :ID:       0dcdccc8-50f8-487d-88c6-1034edc744ef
  :END:
PROPERTIES:
CATEGORY: emacs
END:

** SOMEDAY emdroid hacking
[[http://www.emacswiki.org/emacs/EmDroid][EmDroid]]
  CLOCK: [2012-10-21 Sun 17:23]--[2012-10-21 Sun 17:23] =>  0:00
   :PROPERTIES:
   :ID:       0f28a16d-86ca-4727-b2ca-dc631fe1273f
   :END:
[2012-10-21 Sun 17:23]
** SOMEDAY Implement emacs merge-news for hg
  CLOCK: [2012-10-31 Wed 09:40]--[2012-10-31 Wed 09:40] =>  0:00
   :PROPERTIES:
   :ID:       4fc56c2f-08d8-456b-a8da-66fcfe9d1ec4
   :END:
[2012-10-31 Wed 09:40]
* Projects
  :PROPERTIES:
  :ID:       eb55263d-43e9-4201-8e78-afb142fbc2e3
  :END:
** LinkIt
- This is like ifttt on steroids
- We have sources which are accessed via plugins. These pull in data and convert it into internal format.
- We have matching rules, which is also pluggable. 
  - Match on src (e.g. Google+)
  - Match on type of src (e.g. Google+ post, photo, etc.)
  - Match on tags
  - Match on dropbox new files
- Internal representation
  - Need some raw structure depending on plugin
  - Some common fields like URL, title, author.
  - Are some mandatory?
  - Need mime types like text/html, img/png, etc.
- Plugins should expose available fields
  - e.g. Feedly doesn't have tags, pocket does.

** Coding Ideas
*** Fluid Mechanics
- Port Anuga to Sage!
- Anuga1D.
  - test suites
  - docs
  - rejig the C to be simpler
*** WDM
  - Do this in sage!
*** Vector partitions
- VectorPartitions in Sage
*** Jekyll
**** Jekyll context based config
- Have _config.yml, _includes, _layout in sub-dirs
- Can I do some of this with Rakefiles?
**** Templating
- plugin to use templating language of choice rather than liquid
http://www.cheetahtemplate.org/
http://mustache.github.io/
- what about more general pre- and post-processing, hooks etc.
*** Reading lists/notes/web clipper
- Can I replace Evernote/Pocket with Google+?
- It's just tags.
- Can I "clip" a page with Google+
- Offline mode and having content appear in Evernote/Pocket is very nice!
*** org-mode
- insert boilerplate code on export.
- for instance I want to  add some html to the *body* on export but html-pre/postamble only insert into headers and footer

*** Selected papers
- facebook backend
